// See https://aka.ms/new-console-template for more information

// Задайте двумерный массив. Введите элемент, и найдите первое его вхождение, выведите позиции по горизонтали и вертикали, или напишите, что такого элемента нет.

void PrintMatrix (int [,] array)
{
    for (int i = 0; i < array.GetLength(0); i++)
    {
        for (int j = 0; j < array.GetLength(1); j++)
        {
            Console.Write(array[i,j] + "\t");
        }
            Console.WriteLine();
    }
}

int Prompt(string message)
{
    System.Console.Write($"{message}>");
    int answer = Convert.ToInt32(Console.ReadLine());
    return answer;
}

int [,] GenerateMatrix (int rows, int columns, int minRange, int maxRange)
{
    int [,] array = new int [rows, columns];
    for (int i = 0; i < array.GetLength(0); i++)
        {
            for (int j = 0; j < array.GetLength(1); j++)
            {
                array[i,j] = new Random().Next(minRange, maxRange+1);
            }
        }
    return array;
}

(int?, int?) NumberLookup (int [,] array, int inputNumber)
{
    for (int i = 0; i < array.GetLength(0); i++)
        {
            for (int j = 0; j < array.GetLength(1); j++)
            {
                if (inputNumber == array[i,j])
                    {
                        return (i, j);
                    }
            }
        }
    return (null, null);
}

int rowsInput = Prompt("Введите количество строк массива");
int columnsInput = Prompt("Введите количество столбцов массива");
int min = Prompt("Введите минимальное значение для ячеек массива");
int max = Prompt("Введите максимальное значение для ячеек массива");

int [,] newMatrix = GenerateMatrix(rowsInput, columnsInput, min, max);
PrintMatrix (newMatrix);
Console.WriteLine();

int inputNumber = Prompt("Введите число для поиска");

if (NumberLookup(newMatrix, inputNumber) == (null, null))
{
    Console.WriteLine ($"Число {inputNumber} в массиве не найдено");
}
else 
Console.WriteLine ($"Число {inputNumber} найдено на позиции {NumberLookup(newMatrix, inputNumber)}");